<html>
<head>
<title>Introduction</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#FFFFFF" text="#000000">
<b><u><font face="Arial, Helvetica, sans-serif">VI - FAQ</font></u></b><br>
<br>
&nbsp;&nbsp;<b>6.1 - Pourquoi avoir refait un blog en XML alors qu'il en existe 
d&eacute;j&agrave; ?<a name="1"></a></b><br>
<br>
Et bien.... Posez la question &agrave; celui qui &agrave; fond&eacute; Renault 
ou Peugeot. En claire, j'en est cr&eacute;&eacute; un autre parce que j'en avais 
envie.<br>
<br>
&nbsp;&nbsp;<b>6.2 - Je n'est pas besoin de toutes les fonctions de XP-Blog, y 
a-t-il une version plus l&eacute;g&egrave;re ?</b><a name="2"></a><br>
<br>
Il est vrai que la fonctionnalit&eacute; de cat&eacute;gorie et de types n'est 
pas forc&eacute;ment utile et qu'elle &quot;ralenti&quot; le site. Je pense faire 
une version sans ces fonctionnalit&eacute;es apr&egrave;s la version finale puisqu'il 
y aura la gestion des modules.<br>
<br>
&nbsp;&nbsp;<b>6.3 - Pourquoi il n'y a pas d'interface de configuration ?</b><a name="3"></a><br>
<br>
Bien qu'une interface de configuration soit pratique, elle pr&eacute;sente un 
trou de s&eacute;curit&eacute;. On pourrait se dire que c'est de la parano&iuml;a, 
mais contenu du fait que la configuration n'a besoin d'&ecirc;tre fait qu'une 
seul fois.<br>
<br>
&nbsp;&nbsp;<b>6.4 - Pourquoi la liste des archives n'apparait pas quand on va 
sur une autre page de l'index ?</b><a name="4"></a><br>
<br>
Afin d'&quot;all&egrave;ger&quot; le site, la liste des archives n'apparait que 
sur la page d'index. Th&eacute;oriquement, on n'a pas d'autres pages et si on 
en a une autre et bien... zut.<br>
<br>
&nbsp;&nbsp;<b>6.5 - Comment faire pour avoir &quot;aucun&quot; dans les cat&eacute;gories 
ou les types ?</b><a name="5"></a><br>
<br>
Pour avoir une cat&eacute;gorie ou un type &quot;aucun&quot;, il suffit de les 
cr&eacute;er.<br>
<br>
&nbsp;&nbsp;<b>6.6 - Pourquoi n'y a-t-il pas de gestion de smiley comme PhpBlog 
?</b><br>
<br>
S'il n'y a pas de gestion de smiley comme PhpBlog c'est que c'est trop casse pied 
a g&eacute;rer et faire un clone de PhpBlog &ccedil;a ne sert &agrave; rien.<br>
<br>
<br>
<font size="-1"><i>$ Bubule - 0.8 - 22/05/2003 14h05 $</i></font> 
</body>
</html>
